
## Plan Result (prd)

[CI link](https://github.com/fumi-mura/tfaction-sample/actions/runs/16159527466)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.test_cwlogs1.aws_cloudwatch_log_group.this
  * module.test_cwlogs2.aws_cloudwatch_log_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.test_cwlogs1.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "test-cwlogs1"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Env"                = "prd"
          + "ManagedByTerraform" = "true"
        }
    }

  # module.test_cwlogs2.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "test-cwlogs2"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Env"                = "prd"
          + "ManagedByTerraform" = "true"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"57b90a2a1c2b9a63dbd444321e5a402298c83e8c","Target":"prd","Vars":{},"WorkflowName":"Terraform plan"} -->